/*
Типы коллекций
*/

// Swift предоставляет три основных типа коллекций, 
// известных как массивы, множества и словари, для хранения наборов значений.

// Массивы — это упорядоченные наборы значений. 
// Множества — это неупорядоченные наборы уникальных значений. 
// Словари — это неупорядоченные наборы пар «ключ-значение».

// Массивы, множества и словари в Swift всегда чётко определяют типы значений и ключей, которые они могут хранить. 
// Это означает, что вы не сможете по ошибке вставить в коллекцию значение неправильного типа. 
// Это также означает, что вы можете быть уверены в том, какие значения вы получите из коллекции.

/* 
Изменчивость коллекций
*/

// Если вы создадите массив, набор или словарь и присвоите их переменной, созданная коллекция будет изменяемой. 
// Это означает, что вы можете изменить (или изменить содержимое) коллекции после её создания, добавив, 
// удалив или изменив элементы в ней. Если вы присвоите массив, набор или словарь константе, 
// эта коллекция будет неизменяемой, и её размер и содержимое нельзя будет изменить.